[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:16:23
 const isMemberExpression = S.is(MemberExpression)
 const isCallExpression = S.is(CallExpression)
 
-const isNamedMember = (node: unknown, object: string, property: string): boolean =>
-  isMemberExpression(node) &&
-  isIdentifier(node.object) && node.object.name === object &&
-  isIdentifier(node.property) && node.property.name === property
+const isNamedMember = () => undefined
 
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -909801610, path: "0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 0 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:17:3
 const isCallExpression = S.is(CallExpression)
 
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
-  isMemberExpression(node) &&
-  isIdentifier(node.object) && node.object.name === object &&
+  isMemberExpression(node) && isIdentifier(node.object) || node.object.name === object &&
   isIdentifier(node.property) && node.property.name === property
 
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 153783838, path: "0:0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 2 time(s)
Got TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:17:3
 const isCallExpression = S.is(CallExpression)
 
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
-  isMemberExpression(node) &&
-  isIdentifier(node.object) && node.object.name === object &&
-  isIdentifier(node.property) && node.property.name === property
+  true
 
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 94860969, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:18:32
 
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
   isMemberExpression(node) &&
-  isIdentifier(node.object) && node.object.name === object &&
+  isIdentifier(node.object) && true &&
   isIdentifier(node.property) && node.property.name === property
 
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀p_MemberNameOtherThanSymbolFor_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: 1706935508, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},["Reflect","for"]]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:18:32
 
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
   isMemberExpression(node) &&
-  isIdentifier(node.object) && node.object.name === object &&
+  isIdentifier(node.object) && node.object.name !== object &&
   isIdentifier(node.property) && node.property.name === property
 
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -981910657, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:19:34
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
   isMemberExpression(node) &&
   isIdentifier(node.object) && node.object.name === object &&
-  isIdentifier(node.property) && node.property.name === property
+  isIdentifier(node.property) && true
 
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀p_MemberNameOtherThanSymbolFor_⊥Ignored
statusReason: Property failed after 4 tests
{ seed: 966422065, path: "3:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},["Symbol","iterator"]]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:19:34
 const isNamedMember = (node: unknown, object: string, property: string): boolean =>
   isMemberExpression(node) &&
   isIdentifier(node.object) && node.object.name === object &&
-  isIdentifier(node.property) && node.property.name === property
+  isIdentifier(node.property) && node.property.name !== property
 
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 1826210364, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:21:27
   isIdentifier(node.object) && node.object.name === object &&
   isIdentifier(node.property) && node.property.name === property
 
-const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
+const isSymbolForCallee = () => undefined
 
 const isTaggedFactoryReference = (reference: MemberExpression): boolean =>
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -315282630, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/effect-schema-ignorer/schema-declaration-ignore.ts:21:79
   isIdentifier(node.object) && node.object.name === object &&
   isIdentifier(node.property) && node.property.name === property
 
-const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
+const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, "", 'for')
 
 const isTaggedFactoryReference = (reference: MemberExpression): boolean =>
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 1829458179, path: "0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 0 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:23:34
 
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
 
-const isTaggedFactoryReference = (reference: MemberExpression): boolean =>
-  isIdentifier(reference.property) &&
-  TAGGED_FACTORIES.includes(reference.property.name)
+const isTaggedFactoryReference = () => undefined
 
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 418739895, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:24:3
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
 
 const isTaggedFactoryReference = (reference: MemberExpression): boolean =>
-  isIdentifier(reference.property) &&
-  TAGGED_FACTORIES.includes(reference.property.name)
+  true
 
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀f_FactoryNameOtherThanTagged_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: -2009080244, path: "0:0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"Struct"]
Shrunk 2 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:24:3
 const isSymbolForCallee = (callee: unknown): boolean => isNamedMember(callee, 'Symbol', 'for')
 
 const isTaggedFactoryReference = (reference: MemberExpression): boolean =>
-  isIdentifier(reference.property) &&
-  TAGGED_FACTORIES.includes(reference.property.name)
+  false
 
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -1152644511, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:27:31
   isIdentifier(reference.property) &&
   TAGGED_FACTORIES.includes(reference.property.name)
 
-const isTaggedFactoryCallee = (callee: unknown): boolean =>
-  isCallExpression(callee) && isMemberExpression(callee.callee) && isTaggedFactoryReference(callee.callee)
+const isTaggedFactoryCallee = () => undefined
 
 const isArgumentOf = (
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -1887731480, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:28:3
   TAGGED_FACTORIES.includes(reference.property.name)
 
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
-  isCallExpression(callee) && isMemberExpression(callee.callee) && isTaggedFactoryReference(callee.callee)
+  isCallExpression(callee) && isMemberExpression(callee.callee) || isTaggedFactoryReference(callee.callee)
 
 const isArgumentOf = (
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀p_MemberNameOtherThanSymbolFor_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: 421861113, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},["Reflect","for"]]
Shrunk 1 time(s)
Got TypeError: Cannot read properties of undefined (reading 'property')

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:28:3
   TAGGED_FACTORIES.includes(reference.property.name)
 
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
-  isCallExpression(callee) && isMemberExpression(callee.callee) && isTaggedFactoryReference(callee.callee)
+  true
 
 const isArgumentOf = (
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀p_MemberNameOtherThanSymbolFor_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: -1836836354, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},["Symbol","iterator"]]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:30:22
 const isTaggedFactoryCallee = (callee: unknown): boolean =>
   isCallExpression(callee) && isMemberExpression(callee.callee) && isTaggedFactoryReference(callee.callee)
 
-const isArgumentOf = (
-  node: unknown,
-  parent: unknown,
-  index: number,
-  calleeMatches: (callee: unknown) => boolean,
-): boolean =>
-  isCallExpression(parent) &&
-  calleeMatches(parent.callee) &&
-  parent.arguments[index] === node
+const isArgumentOf = () => undefined
 
 interface IgnoreRule {
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -1126338479, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:36:3
   index: number,
   calleeMatches: (callee: unknown) => boolean,
 ): boolean =>
-  isCallExpression(parent) &&
-  calleeMatches(parent.callee) &&
+  isCallExpression(parent) || calleeMatches(parent.callee) &&
   parent.arguments[index] === node
 
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 1180531009, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:36:3
   index: number,
   calleeMatches: (callee: unknown) => boolean,
 ): boolean =>
-  isCallExpression(parent) &&
-  calleeMatches(parent.callee) &&
-  parent.arguments[index] === node
+  isCallExpression(parent) && calleeMatches(parent.callee) || parent.arguments[index] === node
 
 interface IgnoreRule {
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 41015953, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/effect-schema-ignorer/schema-declaration-ignore.ts:38:3
 ): boolean =>
   isCallExpression(parent) &&
   calleeMatches(parent.callee) &&
-  parent.arguments[index] === node
+  true
 
 interface IgnoreRule {
killedBy: decideSchemaDeclarationIgnore — position and node-type are load-bearing ∀c_ObjectAtTagPosition_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: -225692468, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:38:3
 ): boolean =>
   isCallExpression(parent) &&
   calleeMatches(parent.callee) &&
-  parent.arguments[index] === node
+  parent.arguments[index] !== node
 
 interface IgnoreRule {
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 872820340, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/effect-schema-ignorer/schema-declaration-ignore.ts:48:3
 }
 
 const RULES: ReadonlyArray<IgnoreRule> = [
-  { is: isStringLiteral, argumentIndex: 0, calleeMatches: isSymbolForCallee, reason: SYMBOL_DESCRIPTION_IGNORED },
+  {},
   { is: isStringLiteral, argumentIndex: 0, calleeMatches: isTaggedFactoryCallee, reason: TAGGED_TAG_IGNORED },
   { is: isObjectExpression, argumentIndex: 1, calleeMatches: isTaggedFactoryCallee, reason: TAGGED_FIELDS_IGNORED },
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 683419453, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got TypeError: rule.is is not a function

[Killed] ArrowFunction
src/effect-schema-ignorer/schema-declaration-ignore.ts:53:46
   { is: isObjectExpression, argumentIndex: 1, calleeMatches: isTaggedFactoryCallee, reason: TAGGED_FIELDS_IGNORED },
 ]
 
-export const decideSchemaDeclarationIgnore = (node: unknown, parent: unknown): string | undefined =>
-  RULES.find((rule) => rule.is(node) && isArgumentOf(node, parent, rule.argumentIndex, rule.calleeMatches))?.reason
+export const decideSchemaDeclarationIgnore = () => undefined
 
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀d_SymbolForBrandDescription_∈Ignored
statusReason: Property failed after 1 tests
{ seed: 440797865, path: "0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""}]
Shrunk 1 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] OptionalChaining
src/effect-schema-ignorer/schema-declaration-ignore.ts:54:3
 ]
 
 export const decideSchemaDeclarationIgnore = (node: unknown, parent: unknown): string | undefined =>
-  RULES.find((rule) => rule.is(node) && isArgumentOf(node, parent, rule.argumentIndex, rule.calleeMatches))?.reason
+  RULES.find(rule => rule.is(node) && isArgumentOf(node, parent, rule.argumentIndex, rule.calleeMatches)).reason
 
killedBy: decideSchemaDeclarationIgnore — only the exact discriminant matches ∀p_MemberNameOtherThanSymbolFor_⊥Ignored
statusReason: Property failed after 1 tests
{ seed: -659721880, path: "0:0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},["Symbol","iterator"]]
Shrunk 2 time(s)
Got TypeError: Cannot read properties of undefined (reading 'reason')

[Killed] LogicalOperator
src/effect-schema-ignorer/schema-declaration-ignore.ts:54:24
 ]
 
 export const decideSchemaDeclarationIgnore = (node: unknown, parent: unknown): string | undefined =>
-  RULES.find((rule) => rule.is(node) && isArgumentOf(node, parent, rule.argumentIndex, rule.calleeMatches))?.reason
+  RULES.find((rule) => rule.is(node) || isArgumentOf(node, parent, rule.argumentIndex, rule.calleeMatches))?.reason
 
killedBy: decideSchemaDeclarationIgnore — recognised declarations are ignored ∀c_TaggedClassOrErrorTag_∈Ignored
statusReason: Property failed after 1 tests
{ seed: -1725124587, path: "0:0:0", endOnFailure: true }
Counterexample: [{"type":"StringLiteral","value":""},{"type":"ObjectExpression"},"TaggedClass"]
Shrunk 2 time(s)
Got error: Property failed by returning false

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
